import styles from "./About.module.scss";

interface AboutData {
  title: string;
  content: string[];
  sidebar: string[];
}

const about: AboutData = {
  title: "О нас",
  content: [
    "Образовательная, творческая и производственная среда для интенсивного обучения и роста профессионалов, создания новых форм и областей применения кино и театра.",
    "Мы выпускаем команды, ориентированные на развитие кино, театра и образования.",
  ],
  sidebar: [
    'Подготовка специалистов по программам СПО по специальностям "Кино- и теле производство", "Актёрское искусство" и дополнительным  образовательным программам. На кинофакультете в мастерских “Режиссёр”, “Режиссёр монтажа”, “Звукорежиссёр”,  “Оператор”,“Сценарист” студенты осваивают профессии: режиссёр, второй режиссёр, режиссёр монтажа, звукорежиссёр, кинооператор, второй оператор, продюсер постпродакшена, редактор, а также одну или несколько специальностей второго звена (ассистент режиссёра, администратор, ассистент оператора, осветитель, логер, линейный продюсер, монтажёр, звукооператор, CGI-супервайзер, колорист, гаффер, фокус-пулер,скрипт-супервайзер, ассистент исполнительного продюсера)',
    "На актерском факультете студенты осваивают профессии: актёр театра и кино; преподаватель актёрского мастерства; также можно освоить специальность ассистента по актерам.",
  ],
};

const About: React.FC = () => (
  <section className={styles.about} id="about">
    <h2>{about.title}</h2>
    <div className={styles["about-container"]}>
      <div className={styles["about-content"]}>
        {about.content.map((paragraph, index) => (
          <p key={index}>{paragraph}</p>
        ))}
      </div>
      <div className={styles["about-sidebar"]}>
        {about.sidebar.map((paragraph, index) => (
          <p key={index}>{paragraph}</p>
        ))}
      </div>
    </div>
  </section>
);

export default About;
