import React from "react";
import styles from "./CurriculumCards.module.scss";
import { ListCard } from "../../ui/ListCard";

type Subject = string;
type Courses = { [key: string]: Subject[] | { [key: string]: Subject[] } };
type Faculties = { [key: string]: Courses };

interface CurriculumCardsProps {
  selectedFaculty: string;
}

const faculties: Faculties = {
  "Общее образование": {
    "1 курс": {
      Общеобразовательные: [
        "География",
        "Естествознание и ОБЖ",
        "История",
        "Иностранный язык",
        "Литература",
        "Математика и информатика",
        "Русский язык",
        "Физкультура",
      ],
      Гуманитарные: [
        "Кинодраматургия / История драматургии",
        "История искусств (история ИЗО и история музыки)",
        "История кино",
        "Практическая психология",
      ],
    },
    "2 курс": [
      "Иностранный язык",
      "История",
      "История искусств (история ИЗО и история музыки)",
      "История религий",
      "История театра",
      "Литература",
      "Практическая психология",
      "Философия",
      "Язык кино",
    ],
    "3 курс": [
      "Зарубежная литература на иностранном языке",
      "История религий",
      "Психология искусства и творчества",
      "Философия искусства",
    ],
  },
  "Актёрский факультет": {
    "1 курс": [
      "Актерское мастерство",
      "Вокал",
      "Основы кинопроизводства",
      "Сценическая речь",
      "Танец",
    ],
    "2 курс": [
      "Актерское мастерство",
      "Вокал",
      "Работа актера в кино",
      "Сценическая речь",
      "Танец",
    ],
    "3 курс": [
      "Актерское мастерство",
      "Вокал",
      "Педагогика",
      "Работа актера над ролью",
      "Работа актера в кино",
      "Сцендвижение",
      "Сценическая речь",
      "Танец",
    ],
  },
  Кинофакультет: {
    "1 курс": [
      "Кинопроизводство",
      "Кинодраматургия",
      "Рисунок",
      "Монтаж",
      "Фотография",
      "Работа с актером",
    ],
    "2 курс": [
      "Монтаж",
      "Основы звукорежиссуры",
      "Техника и технологии в современном кинопроизводстве",
      "Бюджет и администрирование кинопроекта",
    ],
    "3 курс": [
      "Монтаж",
      "Семинар по теории кино",
      "Семинар по современному кино",
      "Продюсирование фильма",
    ],
    "4 курс": [
      "Семинар по теории кино",
      "Семинар по современному кино",
      "Продюсирование фильма",
      "Курсы по индивидуальному запросу студентов под специфику диплома",
    ],
  },
};

const facultyTitles: { [key: string]: string } = {
  "Общее образование": "Предметы факультета общего образования:",
  "Актёрский факультет": "Предметы Актёрского факультета:",
  Кинофакультет: "Предметы Кинофакультета:",
};

const CurriculumCards: React.FC<CurriculumCardsProps> = ({
  selectedFaculty,
}) => {
  const courses = faculties[selectedFaculty] || {};

  return (
    <div className={styles["curriculum-container"]}>
      {Object.keys(courses).length > 0 ? (
        <>
          <h2 className={styles.title}>{facultyTitles[selectedFaculty]}</h2>
          <div className={styles["curriculum-box"]}>
            {Object.keys(courses).map((course) => (
              <ListCard
                key={course}
                title={course}
                list={courses[course]}
                customClassName={
                  selectedFaculty === "Общее образование" && course === "1 курс"
                    ? styles["span-two"]
                    : undefined
                }
              />
            ))}
          </div>
        </>
      ) : (
        <p>Нет данных для выбранного факультета</p>
      )}
    </div>
  );
};

export default CurriculumCards;
